export const tasks = [
  {
    chapter: "第一章",
    tasks: [
      {
        id: "M0101",
        title: "添加一个桌面小组件",
        pre: "/",
        repeatable: "是",
        frequency: "一次",
        guide: {
          flag: "addCardVisible",
        },
        type: "store",
        data: "addCardVisible",
        intro:
          "你可以按照需要自由添加自己喜欢的小组件，来搭配自己的桌面，同时绝大多数小组件都支持同时添加多个，以实现不同的功能和用途。",
        description:
          "在桌面空白处「单击右键」，在底部出现的操作栏中选择「添加小组件」。选择「时钟」小组件，点击图片可以预览功能，点击添加按钮将小组件添加到当前桌面上。",
      },
      {
        id: "M0102",
        title: "添加一个桌面",
        pre: "M0101",
        repeatable: "是",
        frequency: "一次",
        intro:
          "喜欢的小组件太多？一个桌面放不下，没关系我们还指出i创建多个桌面，每个桌面都有自己独立的设置，可以添加不同的小组件。",
        description:
          "在桌面空白处「单击右键」，在底部出现的操作栏中选择「添加桌面」；输入「桌面标题」，点击「立即添加」即可完成创建。",
      },
      {
        id: "M0103",
        title: "设置一个桌面壁纸",
        pre: "M0102",
        repeatable: "是",
        frequency: "一次",
        intro:
          "工作台背景太单调？我们提供了自定义壁纸功能，支持选择内置的开源壁纸，或者你可以手动上传自己喜欢的壁纸。",

        description:
          "在桌面空白处「单击右键」，在底部出现的操作栏中选择「设置」，点击进行桌面设置，在这里你可以点击「设置壁纸」进入「壁纸应用」，选择开放的壁纸源或则手动上传自己的本地图片。",
      },
      {
        id: "M0104",
        title: "添加一个导航图标",
        pre: "M0103",
        repeatable: "是",
        frequency: "一次",
        intro: "",

        description:
          "工作台提供了强大的底部和侧边导航栏，你可以按照需要自定义修改需要放置的应用或图标。在导航栏上「单击右键」，在底部出现的操作栏中选择「编辑导航」，即可进入导航栏编辑模式，随意拖动排序、拖出删除，点击「添加」选择需要添加的应用或图标，修改后为自动保存。",
      },
    ],
  },
];
