export const courier=([
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'已签收',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:2
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'在途中',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:1
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'已揽收',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:2
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'已签收',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:3
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'在途中',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:4
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'已揽收',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:1
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'已签收',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:2
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'在途中',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:4
    },
    {
        name:'ZT00003618100',
        company:'中通快递',
        status:'已揽收',
        time:'2022-06-08 15:00:00',
        road:'快件在【北京环铁站】装车,正发往【北京分拨中心】快件在【北京环铁站】装车,正发往【北京分拨中心】快件在【北京环铁站】装车,正发往【北京分拨中心】',
        state:3
    },
])

