export const guide = {
  M0101: [
    // 第一个负责定位和启动任务
    {
      type: "router",
      value: "home",
    },
    {
      title: "桌面操作菜单",
      text: "点击这里（或桌面空白处「单击右键键」），打开桌面的底部操作栏，可以选择桌面相关的功能操作。",
    },
    {
      time: 300,
      title: "添加小组件",
      text: "点击这里进入「创意市场」，目前有数十个类型的小组件任你选择。",
      position: "top",
    },
    {
      title: "添加小组件",
      text: "点击「添加按钮」将小组件添加到你的桌面。",
      position: "top",
    },
    // 最后一个是完成任务的标记
    {
      success: true,
    },
  ],
  M0102: [
    // 第一个负责定位和启动任务
    {
      type: "router",
      value: "home",
    },
    {
      title: "桌面操作菜单 1/3",
      text: "点击这里（或桌面空白处「单击右键键」），打开桌面的底部操作栏，可以选择桌面相关的功能操作。",
    },
    {
      time: 500,
      title: "添加桌面",
      text: "点击这里打开「添加桌面」侧滑弹窗，在弹窗中设置添加桌面。",
      position: "top",
    },
    {
      time: 500,
      title: "添加桌面",
      text: "有四种默认桌面模版供你选择，输入你想创建的煮面名称，选择一个「初始布局」，并点「立即添加」即可完成。",
      position: "top",
    },
    // 最后一个是完成任务的标记
    {
      success: true,
    },
  ],
  M0103: [
    // 第一个负责定位和启动任务
    {
      type: "router",
      value: "home",
    },
    {
      id: 1,
      title: "背景设置",
      text: "点击这里打开「设置」侧滑弹窗，在弹窗中选择背景设置。",
    },
    {
      id: 2,

      time: 500,
      title: "背景设置",
      text: "点击这里打开「添加桌面」侧滑弹窗，在弹窗中设置添加桌面。",
      position: "top",
    },
    {
      id: 3,

      time: 200,
      title: "背景设置",
      text: `在这里你可以修改所有桌面的属性，调整卡片的缩放比例、间距，设置背景和特殊效果。也可以针对单个桌面做个性化设置。
      
      本次任务让我们选择「背景设置」，为桌面设置一个合适的壁纸。`,
      position: "left",
    },
    {
      id: 4,
      title: "背景设置",
      text: "点击「背景设置」，进入「壁纸」应用，选择喜欢的壁纸。",
      position: "bottom",
    },
    {
      id: 5,
      title: "背景设置",
      text: "在这里你可以选择「自定义上传」，或者选择来自「必应壁纸」、「拾光壁纸」和「动态壁纸」，将喜欢的壁纸设置为系统桌面壁纸或者工作台背景。本次任务让我们来给工作台添加一个背景壁纸。",
      position: "left",
    },
    {
      id: 6,
      title: "背景设置",
      text: "「右键单击」喜欢的壁纸，在弹出的底部操作栏中选择「设置为工作台背景」",
    },
    {
      id: 7,

      time: 300,
      title: "背景设置",
      text: "点击「设为工作台背景」即可完成背景设置。",
    },
    // 最后一个是完成任务的标记
    {
      success: true,
    },
  ],
  M0104: [
    // 第一个负责定位和启动任务
    {
      type: "router",
      value: "home",
    },
    {
      title: "编辑导航",
      text: "在「底部导航」或「侧边导航行」上「右键单击」」",
    },
    {
      time: 300,
      title: "编辑导航",
      text: "选择「编辑导航」，进入导航栏编辑模式。",
      position: "top",
    },
    {
      title: "编辑导航",
      text: "在这里你可以自由修改导航栏的用图标，选择开启侧边导航或关闭底部导航等操作。本次任务让我们来给「底部导航」添加一个图标。",
      position: "top",
    },
    // 最后一个是完成任务的标记
    {
      success: true,
    },
  ],
};
