export const tasks = {
  games: [
    {
      chapter: "游戏",
      name: "game",
      info: "绑定Steam游戏库，一键启动游戏，实时检测系统性能数据，快来了解下都有哪些好用的功能吧。",
      tasks: [
        {
          pre: "",
          id: "Z0101",
          title: "绑定Steam账号",
          info: "游戏助手可以支持绑定Steam账号，读取游戏库数据，在工作台中快速启动你的游戏，还支持个性化游戏桌面搭建和攻略查询。",
        },
        {
          pre: "Z0101",
          id: "Z0102",
          title: "从游戏助手中启动一个Steam游戏",
          info: "你已经完成了Steam账号绑定，可以看到你的游戏库数据，点击某个游戏在弹出的面板中即可选择启动游戏。",
        },
        {
          pre: "Z0101",
          id: "Z0103",
          title: "添加一个游戏桌面",
          info: "你可以基于某个游戏来为其搭建一个桌面，分配不同的小组件。",
        },
        {
          pre: "",
          id: "Z0104",
          title: "使用捕获功能创建一个游戏截图",
          info: "精彩时刻不容错过，使用游戏助手的捕获功能轻松截取游戏时刻，同时支持自定义设置截图保存位置。",
        },
        {
          pre: "",
          id: "Z0105",
          title: "使用捕获助手创建一个游戏录屏",
          info: "精彩时刻不容错过，使用游戏助手的捕获功能轻松截取游戏时刻，同时支持自定义设置录频保存位置。",
        },
        {
          pre: "",
          id: "Z0106",
          title: "在桌面上添加一个性能监控小组件，并成功获取一次系统性能数据",
          info: "想要实时关注游戏的性能指标，在桌面上添加性能监控小组件，搭配主流的AIDA64和RTSS软件，来实现完整的系统性能监控。",
        },
      ],
    },
  ],
  works: [
    {
      chapter: "效率",
      info: "剪贴板历史数据读取，应用常见快捷键查阅，还有自定义系统快捷指令任你选择。",
      tasks: [
        {
          pre: "",
          id: "Z0201",
          title: "添加并使用一个快捷指令",
          info: "你可以自定义创建系统快捷指令，支持CMD命令行，自定义快捷键等等。",
        },
        // {
        //   pre: "",
        //   id: "Z0202",
        //   title: "添加并使用一个应用快捷键方案",
        //   info: "自己常用的软件快捷键记不住怎么办？在工作台中你可以轻松创建一个软件的快捷键方案，并在使用指定软件时打开。",
        // },
        {
          pre: "",
          id: "Z0203",
          title: "创建一个待办",
          info: "工作台内置了一个简洁的待办事项小组件，可以快速创建待办任务。",
        },
      ],
    },
    {
      chapter: "创意分享",
      info: "独特的桌面方案，有趣的小组件，与大家分享你的创意。",
      tasks: [
        {
          pre: "",
          id: "Z0301",
          title: "分享一个桌面",
          info: "搭配除了不错的桌面方案，快来分享给社区其他用户吧。",
        },
        {
          pre: "",
          id: "Z0302",
          title: "分享一个小组件",
          info: "搭配除了不错的外部小组件方案，快来分享给社区其他用户吧。",
        },
      ],
    },
  ],
  chats: [
    {
      chapter: "小队",
      info: "与全网的工作台小伙伴自由组成小队，一同体验“等级加速”、“道具互动”、等等那些旧时的回忆和乐趣，为你带来一种不一样的陪伴感。",
      tasks: [
        {
          pre: "",
          id: "Z0401",
          title: "创建/加入一个小队",
          info: "不一样的小队功能，不一样的陪伴体验",
        },
        {
          pre: "",
          id: "Z0402",
          title: "领取一次小队加速时长",
          info: "等级加速太慢了，让小队帮你提提速",
        },
      ],
    },
    {
      chapter: "弹幕",
      info: "浏览视频能看弹幕，这我知道，什么，你说平时用的软件也有弹幕？",
      tasks: [
        {
          pre: "",
          id: "Z0501",
          title: "发布一条全网弹幕",
          info: "与全网的小伙伴互动胰一下吧",
        },
        {
          pre: "Z0401",
          id: "Z0502",
          title: "发布一条小队弹幕",
          info: "与你的小队成员互动一下吧",
        },
      ],
    },
    {
      chapter: "团队",
      info: "暂无",
      tasks: [
        {
          pre: "",
          id: "Z0601",
          title: "创建/加入一个群聊",
          info: "内置即时聊天功能，和你的小伙伴畅快沟通吧。",
        },
        {
          pre: "",
          id: "Z0602",
          title: "添加一个好友",
          info: "快来扩充一下你的好友列表。",
        },
      ],
    },
  ],
};
